========================================================================================
	Создание функции нахождения минимального количества прыжков,
	чтобы пройти от начала до конца
========================================================================================

CREATE FUNCTION task_1(@start int, @end int)
	RETURNS int
    BEGIN
    	DECLARE @result int
        set @result = ((@end-@start) / 3) + ((@end-@start) - (3 * ((@end-@start) / 3)))
    	RETURN @result
    END

========================================================================================
	Запуск функции
	args:
		start (int) - начальная полка
		stop (int) - конечная полка
	return:
		result (int) - минимальное количество прыжков
========================================================================================

SELECT dbo.task_1(1,10)
    